Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.1"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>WCH Ltd.</vendor>    <!-- device vendor name -->
    <vendorID>WCH</vendorID>    <!-- device vendor short name -->
    <name>CH583SFR</name>    <!-- name of part-->
    <series>CH58x</series>    <!-- device series the device belongs to -->
    <version>1.1</version>    <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
    <description>WCH wireless MCU CH58x Family Support, Drivers</description>
    <cpu>        <!-- details about the cpu embedded in the device -->
        <name>RISC-V</name>
        <revision>r0p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>2</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>    <!-- byte addressable memory -->
    <width>32</width>    <!-- bus width is 32 bits -->
    <!-- default settings implicitly inherited by subsequent sections -->
    <size>32</size>    <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
    <resetValue>0x00000000</resetValue>    <!-- by default all bits of the registers are initialized to 0 on reset -->
    <resetMask>0xFFFFFFFF</resetMask>    <!-- by default all 32Bits of the registers are used -->

    <peripherals>
        <peripheral>
            <name>SYS</name>
            <description>System Control Register</description>
            <groupName>SystemControl</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR0</name>
                <description>TMR0_IRQHandler</description>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>GPIO_A</name>
                <description>GPIO_IRQHandler</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>GPIO_B</name>
                <description>GPIO_IRQHandler</description>
                <value>18</value>
            </interrupt>
            <interrupt>
                <name>SPI0</name>
                <description>SPI0_IRQHandler</description>
                <value>19</value>
            </interrupt>
            <interrupt>
                <name>BLEL</name>
                <description>LLE_IRQHandler</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>BLEB</name>
                <description>BB_IRQHandler</description>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>USB</name>
                <description>USB_IRQHandler</description>
                <value>22</value>
            </interrupt>
            <interrupt>
                <name>USB2</name>
                <description>USB2_IRQHandler</description>
                <value>23</value>
            </interrupt>
            <interrupt>
                <name>TMR1</name>
                <description>TMR1_IRQHandler</description>
                <value>24</value>
            </interrupt>
            <interrupt>
                <name>TMR2</name>
                <description>TMR2_IRQHandler</description>
                <value>25</value>
            </interrupt>
            <interrupt>
                <name>UART0</name>
                <description>UART0_IRQHandler</description>
                <value>26</value>
            </interrupt>
            <interrupt>
                <name>UART1</name>
                <description>UART1_IRQHandler</description>
                <value>27</value>
            </interrupt>
            <interrupt>
                <name>RTC</name>
                <description>RTC_IRQHandler</description>
                <value>28</value>
            </interrupt>
            <interrupt>
                <name>ADC</name>
                <description>ADC_IRQHandler</description>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>I2C</name>
                <description>I2C_IRQHandler</description>
                <value>30</value>
            </interrupt>
            <interrupt>
                <name>PWMX_SPI1</name>
                <description>PWMX_SPI1_IRQHandler</description>
                <value>31</value>
            </interrupt>
            <interrupt>
                <name>TMR3</name>
                <description>TMR3_IRQHandler</description>
                <value>32</value>
            </interrupt>
            <interrupt>
                <name>UART2</name>
                <description>UART2_IRQHandler</description>
                <value>33</value>
            </interrupt>
            <interrupt>
                <name>UART3</name>
                <description>UART3_IRQHandler</description>
                <value>34</value>
            </interrupt>
            <interrupt>
                <name>WDOG_BAT</name>
                <description>WDT_IRQHandler</description>
                <value>35</value>
            </interrupt>
            <registers>
                <register>
                    <name>R16_CLK_SYS_CFG</name>
                    <description>RWA, system clock configuration, SAM</description>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0005</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_PLL_DIV</name>
                            <description>RWA, output clock divider from PLL or CK32M</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_CLK_SYS_MOD</name>
                            <description>RWA, system clock source mode: 00=divided from 32MHz, 01=divided from PLL-480MHz, 10=directly from 32MHz, 11=directly from 32KHz</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_HFCK_PWR_CTRL</name>
                    <description>RWA, high frequency clock module power control, SAM</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x14</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_XT32M_PON</name>
                            <description>RWA, external 32MHz oscillator power control: 0=power down, 1-power on</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_CLK_XT32M_KEEP</name>
                            <description>RWA, external 32MHz oscillator power keep under halt mode: 0=auto stop, 1=keep running</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_CLK_PLL_PON</name>
                            <description>RWA, PLL power control: 0=power down, 1-power on</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SLP_CLK_OFF0</name>
                    <description>RWA, sleep clock off control byte 0, SAM</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SLP_CLK_TMR0</name>
                            <description>RWA, close TMR0 clock</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_TMR1</name>
                            <description>RWA, close TMR1 clock</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_TMR2</name>
                            <description>RWA, close TMR2 clock</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_TMR3</name>
                            <description>RWA, close TMR3 clock</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_UART0</name>
                            <description>RWA, close UART0 clock</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_UART1</name>
                            <description>RWA, close UART1 clock</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_UART2</name>
                            <description>RWA, close UART2 clock</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_UART3</name>
                            <description>RWA, close UART3 clock</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SLP_CLK_OFF1</name>
                    <description>RWA, sleep clock off control byte 1, SAM</description>
                    <addressOffset>0x0D</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SLP_CLK_SPI0</name>
                            <description>RWA, close SPI0 clock</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_SPI1</name>
                            <description>RWA, close SPI1 clock</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_PWMX</name>
                            <description>RWA, close PWMx clock</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_I2C</name>
                            <description>RWA, close I2C clock</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_USB</name>
                            <description>RWA, close USB clock</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_BLE</name>
                            <description>RWA, close BLE clock</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SLP_WAKE_CTRL</name>
                    <description>RWA, wake control, SAM</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x20</resetValue>
                    <fields>
                        <field>
                            <name>RB_SLP_USB_WAKE</name>
                            <description>RWA, enable USB waking</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_USB2_WAKE</name>
                            <description>RWA, enable USB2 waking</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_RTC_WAKE</name>
                            <description>RWA, enable RTC waking</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_GPIO_WAKE</name>
                            <description>RWA, enable GPIO waking</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_BAT_WAKE</name>
                            <description>RWA, enable BAT waking</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_WAKE_EV_MODE</name>
                            <description>RWA, event wakeup mode</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SLP_POWER_CTRL</name>
                    <description>RWA, peripherals power down control, SAM</description>
                    <addressOffset>0x0F</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_WAKE_DLY_MOD</name>
                            <description>RWA, wakeup delay time selection</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_RAMX</name>
                            <description>RWA, close main SRAM clock</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SLP_CLK_RAM2K</name>
                            <description>RWA, close retention 2KB SRAM clock</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_RAM_RET_LV</name>
                            <description>RWA, SRAM retention voltage selection</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PIN_ALTERNATE</name>
                    <description>RW, function pin alternate configuration</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_PIN_TMR0</name>
                            <description>RW, TMR0 alternate pin enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_TMR1</name>
                            <description>RW, TMR1 alternate pin enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_TMR2</name>
                            <description>RW, TMR2 alternate pin enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_TMR3</name>
                            <description>RW, TMR3 alternate pin enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_UART0</name>
                            <description>RW, RXD0/TXD0 alternate pin enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_UART1</name>
                            <description>RW, RXD1/TXD1 alternate pin enable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_UART2</name>
                            <description>RW, RXD2/TXD2 alternate pin enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_UART3</name>
                            <description>RW, RXD3/TXD3 alternate pin enable</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_SPI0</name>
                            <description>RW, SCS/SCK0/MOSI/MISO alternate pin enable</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_PWMX</name>
                            <description>RW, PWM4/PWM5/PWM7/PWM8/PWM9 alternate pin enable</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_I2C</name>
                            <description>RW, SCL/SDA alternate pin enable</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_MODEM</name>
                            <description>RW, DSR/DTR alternate pin enable</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_INTX</name>
                            <description>RW, interrupt INT24/INT25 alternate pin enable</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_U0_INV</name>
                            <description>RW, SCL/SDA alternRW, RXD0/RXD0_/TXD0/TXD0_ invert input/output enableate pin enable</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>RB_RF_ANT_SW_EN</name>
                            <description>RW, RF antenna switch control output enable</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>
                </register>
