Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
                <register>
                    <name>R16_PIN_ANALOG_IE</name>
                    <description>RW, analog pin enable and digital input disable</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_PIN_ADC8_9_IE</name>
                            <description>RW, ADC/TouchKey channel 9/8 digital input disable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC6_7_IE</name>
                            <description>RW, ADC/TouchKey channel 7/6 digital input disable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC10_IE</name>
                            <description>RW, ADC/TouchKey channel 10 digital input disable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC11_IE</name>
                            <description>RW, ADC/TouchKey channel 11 digital input disable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_USB2_DP_PU</name>
                            <description>RW,USB2 UDP internal pullup resistance enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_USB2_IE</name>
                            <description>RW, USB analog I/O enable: 0=analog I/O disable, 1=analog I/O enable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_USB_DP_PU</name>
                            <description>RW,USB UDP internal pullup resistance enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_USB_IE</name>
                            <description>RW, USB analog I/O enable: 0=analog I/O disable, 1=analog I/O enable</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC0_IE</name>
                            <description>RW, ADC/TouchKey channel0 digital input disable: 0=digital input enable, 1=digital input disable</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC1_IE</name>
                            <description>RW, ADC/TouchKey channel1 digital input disable: 0=digital input enable, 1=digital input disable</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC12_IE</name>
                            <description>RW, ADC/TouchKey channel12 digital input disable: 0=digital input enable, 1=digital input disable</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC13_IE</name>
                            <description>RW, ADC/TouchKey channel13 digital input disable: 0=digital input enable, 1=digital input disable</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_XT32K_IE</name>
                            <description>RW, external 32KHz oscillator digital input disable: 0=digital input enable, 1=digital input disable</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC2_3_IE</name>
                            <description>RW, ADC/TouchKey channel 2/3 digital input disable: 0=digital input enable, 1=digital input disable</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>RB_PIN_ADC4_5_IE</name>
                            <description>RW, ADC/TouchKey channel 4/5 digital input disable: 0=digital input enable, 1=digital input disable</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_POWER_PLAN</name>
                    <description>RWA, power plan before sleep instruction, SAM</description>
                    <addressOffset>0x20</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x11DF</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWR_XROM</name>
                            <description>RWA, power for retention 2KB SRAM</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWR_RAM2K</name>
                            <description>RWA, power for retention 2KB SRAM</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWR_CORE</name>
                            <description>RWA, power retention for core and base peripherals</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWR_EXTEND</name>
                            <description>RWA, power retention for USB and BLE</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWR_RAM30K</name>
                            <description>RWA, power for main SRAM</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWR_SYS_EN</name>
                            <description>RWA, power for system</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWR_DCDC_EN</name>
                            <description>RWA, DC/DC converter enable: 0=DC/DC disable and bypass, 1=DC/DC enable</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWR_DCDC_PRE</name>
                            <description>RWA, DC/DC converter pre-enable</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWR_MUST_0010</name>
                            <description>RWA, power plan enable, auto clear after sleep executed</description>
                            <bitRange>[14:11]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RB_PWR_PLAN_EN</name>
                            <description>RWA, must write 0010</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_AUX_POWER_ADJ</name>
                    <description>RWA, aux power adjust control, SAM</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ULPLDO_ADJ</name>
                            <description>RWA, Ultra-Low-Power LDO voltage adjust</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_DCDC_CHARGE</name>
                            <description>RWA, Ultra-Low-Power LDO voltage adjust</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_DET_CTRL</name>
                    <description>RWA, battery voltage detector control, SAM</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_DET_EN/RB_BAT_LOW_VTHX</name>
                            <description>RWA, battery voltage detector enable/select monitor threshold voltage</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_BAT_MON_EN</name>
                            <description>RWA, battery voltage monitor enable under sleep mode</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_BAT_LOWER_IE</name>
                            <description>RWA, interrupt enable for battery lower voltage</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_BAT_LOW_IE</name>
                            <description>RWA, interrupt enable for battery low voltage</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_DET_CFG</name>
                    <description>RWA, battery voltage detector configuration, SAM</description>
                    <addressOffset>0x25</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x01</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_LOW_VTH</name>
                            <description>RWA, select threshold voltage of battery voltage low</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_STATUS</name>
                    <description>RO, battery status</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_STAT_LOWER</name>
                            <description>RO, battery lower voltage status, high action</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_BAT_STAT_LOW</name>
                            <description>RO, battery low voltage status, high action</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_INT32K_TUNE</name>
                    <description>RWA, internal 32KHz oscillator tune control, SAM</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x1011</resetValue>
                    <fields>
                        <field>
                            <name>RB_INT32K_TUNE</name>
                            <description>RWA, internal 32KHz oscillator frequency tune</description>
                            <bitRange>[12:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_XT32K_TUNE</name>
                    <description>RWA, external 32KHz oscillator tune control, SAM</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xC3</resetValue>
                    <fields>
                        <field>
                            <name>RB_XT32K_I_TUNE</name>
                            <description>RWA, external 32KHz oscillator current tune: 00=75% current, 01=standard current, 10=150% current, 11=200% current</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_XT32K_C_LOAD</name>
                            <description>RWA, external 32KHz oscillator load capacitor tune: Cap = RB_XT32K_C_LOAD + 12pF</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_CK32K_CONFIG</name>
                    <description>RWA, 32KHz oscillator configure</description>
                    <addressOffset>0x2F</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xX2</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_XT32K_PON</name>
                            <description>RWA, external 32KHz oscillator power on</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_CLK_INT32K_PON</name>
                            <description>RWA, internal 32KHz oscillator power on</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OSC32K_XT</name>
                            <description>RWA, 32KHz oscillator source selection: 0=RC, 1=XT</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OSC32K_FILT</name>
                            <description>RWA, internal 32KHz oscillator low noise mode enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_32K_CLK_PIN</name>
                            <description>RO, 32KHz oscillator clock pin status</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_RTC_FLAG_CTRL</name>
                    <description>RW, RTC flag and clear control</description>
                    <addressOffset>0x30</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x30</resetValue>
                    <fields>
                        <field>
                            <name>RB_RTC_TMR_CLR</name>
                            <description>RW, set 1 to clear RTC timer action flag, auto clear</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_RTC_TRIG_CLR</name>
                            <description>RW, set 1 to clear RTC trigger action flag, auto clear</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_RTC_TMR_FLAG</name>
                            <description>RO, RTC timer action flag</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RB_RTC_TRIG_FLAG</name>
                            <description>RO, RTC trigger action flag</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_RTC_MODE_CTRL</name>
                    <description>RWA, RTC mode control, SAM</description>
                    <addressOffset>0x31</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>RB_RTC_TMR_MODE</name>
                            <description>RWA, RTC timer mode: 000=0.125S, 001=0.25S, 010=0.5S, 011=1S, 100=2S, 101=4S, 110=8S, 111=16S</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_RTC_IGNORE_B0</name>
                            <description>RWA, force ignore bit0 for trigger mode: 0=compare bit0, 1=ignore bit0</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_RTC_TMR_EN</name>
                            <description>RWA, RTC timer mode enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_RTC_TRIG_EN</name>
                            <description>RWA, RTC trigger mode enable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_RTC_LOAD_LO</name>
                            <description>RWA, set 1 to load RTC count low word R32_RTC_CNT_32K, auto clear after loaded</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_RTC_LOAD_HI</name>
                            <description>RWA, set 1 to load RTC count high word R32_RTC_CNT_DAY, auto clear after loaded</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_RTC_TRIG</name>
                    <description>RWA, RTC trigger value, SAM</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_RTC_TRIG</name>
                            <description>RWA, RTC trigger value</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_RTC_CNT_32K</name>
                    <description>RO, RTC count based 32KHz</description>
                    <addressOffset>0x38</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R16_RTC_CNT_32K</name>
                            <description>RWA,RTC count based 32KHz</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_RTC_CNT_2S</name>
                    <description>RO, RTC count based 2 second</description>
                    <addressOffset>0x3A</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R16_RTC_CNT_2S</name>
                            <description>RO, RTC count based 2 second</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_RTC_CNT_DAY</name>
                    <description>RO, RTC count based one day, only low 14 bit</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_RTC_CNT_DAY</name>
                            <description>RWA,RTC count based one day</description>
                            <bitRange>[13:0]</bitRange>
                        </field>
                    </fields>
                </register>
