Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
                <register>
                    <name>R8_SAFE_ACCESS_SIG</name>
                    <description>WO, safe accessing sign register, must write SAFE_ACCESS_SIG1 then SAFE_ACCESS_SIG2 to enter safe accessing mode</description>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SAFE_ACC_MODE</name>
                            <description>RO, current safe accessing mode: 11=safe unlocked (SAM), other=locked (00..01..10..11)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SAFE_ACC_ACT</name>
                            <description>RO, indicate safe accessing status now: 0=locked, read only, 1=safe/unlocked (SAM), write enabled</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SAFE_ACC_TIMER</name>
                            <description>RO, safe accessing timer bit mask (16*clock number)</description>
                            <bitRange>[6:4]</bitRange>
                        </field>
                        <field>
                            <name>R8_SAFE_ACCESS_SIG</name>
                            <description>WO, safe accessing sign register, must write 0x57 then 0xA8 to enter safe accessing mode</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_CHIP_ID</name>
                    <description>RF, chip ID register, always is ID_CH58*</description>
                    <addressOffset>0x41</addressOffset>
                    <size>8</size>
                    <access>Read-only</access>
                    <resetValue>0x83</resetValue>
                    <fields>
                        <field>
                            <name>R8_CHIP_ID</name>
                            <description>RF,chip ID register </description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SAFE_ACCESS_ID</name>
                    <description>RF, safe accessing ID register, always 0x0C</description>
                    <addressOffset>0x42</addressOffset>
                    <size>8</size>
                    <access>Read-only</access>
                    <resetValue>0x0C</resetValue>
                    <fields>
                        <field>
                            <name>R8_SAFE_ACCESS_ID</name>
                            <description>RF,safe accessing ID register </description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_WDOG_COUNT</name>
                    <description>RW, watch-dog count, count by clock frequency Fsys/131072</description>
                    <addressOffset>0x43</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_WDOG_COUNT</name>
                            <description>RF,watch-dog count, count by clock frequency Fsys/131072</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_RESET_STATUS_R8_GLOB_ROM_CFG</name>
                    <description>RWA, reset status, SAM or flash ROM configuration</description>
                    <addressOffset>0x44</addressOffset>
                    <access>Read-only</access>
                    <size>8</size>
                    <resetValue>0x01</resetValue>
                    <fields>
                        <field>
                            <name>RB_RESET_FLAG</name>
                            <description>RO, recent reset flag</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RB_ROM_CODE_OFS</name>
                            <description>RWA, code offset address selection in Flash ROM: 0=start address 0x000000, 1=start address 0x008000</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_ROM_CTRL_EN</name>
                            <description>RWA, enable flash ROM control interface enable</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_ROM_DATA_WE</name>
                            <description>RWA,enable flash ROM data and code area being erase/write</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_ROM_CODE_WE</name>
                            <description>RWA, enable flash ROM code area being erase or write</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_GLOB_CFG_INFO</name>
                    <description>RO, global configuration information and status</description>
                    <addressOffset>0x45</addressOffset>
                    <access>read-only</access>
                    <size>8</size>
                    <resetValue>0xEX</resetValue>
                    <fields>
                        <field>
                            <name>RB_CFG_ROM_READ</name>
                            <description>RO, indicate protected status of Flash ROM code and data: 0=reading protect, 1=enable read by external programmer</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_CFG_RESET_EN</name>
                            <description>RO, manual reset input enable status</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_CFG_BOOT_EN</name>
                            <description>RO, boot-loader enable status</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_CFG_DEBUG_EN</name>
                            <description>RO, debug enable status</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_BOOT_LOADER</name>
                            <description>RO, indicate boot loader status: 0=application status (by software reset), 1=boot loader status</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_RST_WDOG_CTRL</name>
                    <description>RWA, reset and watch-dog control, SAM</description>
                    <addressOffset>0x46</addressOffset>
                    <access>Read-Write</access>
                    <size>8</size>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SOFTWARE_RESET</name>
                            <description>WA or WZ, global software reset, high action, auto clear</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_WDOG_RST_EN</name>
                            <description>RWA, enable watch-dog reset if watch-dog timer overflow: 0=as timer only, 1=enable reset if timer overflow</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_WDOG_INT_EN</name>
                            <description>RWA, watch-dog timer overflow interrupt enable: 0=disable, 1=enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_WDOG_INT_FLAG</name>
                            <description>RW1, watch-dog timer overflow interrupt flag, cleared by RW1 or reload watch-dog count or __SEV(Send-Event)</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_GLOB_RESET_KEEP</name>
                    <description>RW, value keeper during global reset</description>
                    <addressOffset>0x47</addressOffset>
                    <access>read-write</access>
                    <size>8</size>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_GLOB_RESET_KEEP</name>
                            <description>RW, value keeper during global reset</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_PLL_CONFIG</name>
                    <description>RWA, PLL configuration control, SAM</description>
                    <addressOffset>0x4B</addressOffset>
                    <size>8</size>
                    <resetValue>0x4A</resetValue>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RB_PLL_CFG_DAT</name>
                            <description>RWA, PLL configure data</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_FLASH_IO_MOD</name>
                            <description>RWA, flash ROM interface mode</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_XT32M_TUNE</name>
                    <description>RWA, external 32MHz oscillator tune control, SAM</description>
                    <addressOffset>0x4E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x32</resetValue>
                    <fields>
                        <field>
                            <name>RB_XT32M_I_BIAS</name>
                            <description>RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_XT32M_C_LOAD</name>
                            <description>RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF</description>
                            <bitRange>[6:4]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_OSC_CAL_CNT</name>
                    <description>RO, system clock count value for 32KHz multi-cycles</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_OSC_CAL_CNT</name>
                            <description>RO, system clock count value for 32KHz multi-cycles</description>
                            <bitRange>[13:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_OSC_CAL_OV_CLR</name>
                            <description>RW1, indicate R8_OSC_CAL_OV_CNT not zero, set 1 to clear R8_OSC_CAL_OV_CNT</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>RB_OSC_CAL_IF</name>
                            <description>RW1, interrupt flag for oscillator capture end, set 1 to clear</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_OSC_CAL_CTRL</name>
                    <description>RWA, oscillator frequency calibration control, SAM</description>
                    <addressOffset>0x53</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x09</resetValue>
                    <fields>
                        <field>
                            <name>RB_OSC_CNT_TOTAL</name>
                            <description>RWA, total cycles mode for oscillator capture</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_OSC_CNT_HALT</name>
                            <description>RO, calibration counter halt status: 0=counting, 1=halt for reading count value</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RB_OSC_CAL_IE</name>
                            <description>RWA, interrupt enable for oscillator capture end</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_OSC_CNT_EN</name>
                            <description>RWA, calibration counter enable</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_OSC_CNT_END</name>
                            <description>RWA, select oscillator capture end mode: 0=normal, 1=append 2 cycles</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_OSC_CAL_OV_CNT</name>
                    <description>RO, oscillator frequency calibration overflow times</description>
                    <addressOffset>0x52</addressOffset>
                    <size>8</size>
                    <access>Read-only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_OSC_CAL_OV_CNT</name>
                            <description>RO, oscillator frequency calibration overflow times</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TKEY_COUNT</name>
                    <description>RW, Touchkey charge and discharge count</description>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TKEY_CHARG_CNT</name>
                            <description>RW, Touchkey charge count</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TKEY_DISCH_CNT</name>
                            <description>RW, Touchkey discharge count</description>
                            <bitRange>[7:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TKEY_CONVERT</name>
                    <description>RW, Touchkey convert start control</description>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TKEY_START</name>
                            <description>RW, Touchkey convert start control</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TKEY_CFG</name>
                    <description>RW, Touchkey configure</description>
                    <addressOffset>0x57</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TKEY_PWR_ON</name>
                            <description>RW, Touchkey power on</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TKEY_CURRENT</name>
                            <description>RW, Touchkey charge current selection</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_TKEY_DRV_EN</name>
                            <description>RW, Touchkey drive shield enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_TKEY_PGA_ADJ</name>
                            <description>RW, ADC input PGA speed selection</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_CHANNEL</name>
                    <description>RW, ADC input channel selection</description>
                    <addressOffset>0x58</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0F</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_CH_INX</name>
                            <description>RW, ADC input channel index</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_CFG</name>
                    <description>RW, ADC configure</description>
                    <addressOffset>0x59</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xA0</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_POWER_ON</name>
                            <description>RW, ADC power control: 0=power down, 1=power on</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_BUF_EN</name>
                            <description>RW, ADC input buffer enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_DIFF_EN</name>
                            <description>RW, ADC input channel mode: 0=single-end, 1=differnetial</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_OFS_TEST</name>
                            <description>RW, enable ADC offset test mode: 0=normal mode, 1=short to test offset</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_PGA_GAIN</name>
                            <description>RW, set ADC input PGA gain: 00=-12dB, 01=-6dB, 10=0dB, 11=6dB</description>
                            <bitRange>[5:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_CLK_DIV</name>
                            <description>RW, select ADC clock frequency: 00=3.2MHz, 01=2.67MHz, 10=5.33MHz, 11=4MHz</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                    </fields>
                </register>
