Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
                <register>
                    <name>R8_ADC_CONVERT</name>
                    <description>RW, ADC convert control</description>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_START</name>
                            <description>RW, ADC convert start control: 0=stop ADC convert, 1=start an ADC convert, auto clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RB_ADC_EOC_X</name>
                            <description>RO, end of ADC conversion flag</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TEM_SENSOR</name>
                    <description>RW, temperature sensor control</description>
                    <addressOffset>0x5B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TEM_SEN_PWR_ON</name>
                            <description>RW, temperature sensor power control: 0=power down, 1=power on</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_ADC_DATA</name>
                    <description>RO, ADC data</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_DATA</name>
                            <description>RO, ADC conversion data</description>
                            <bitRange>[11:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_INT_FLAG</name>
                    <description>RO, ADC interrupt flag register</description>
                    <addressOffset>0x5E</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_IF_EOC</name>
                            <description>RO, ADC conversion interrupt flag: 0=free or converting, 1=end of conversion, interrupt action, write R8_ADC_CONVERT to clear flag</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_ADC_DMA_CTRL</name>
                    <description>RO, ADC DMA control and status register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R32_ADC_DMA_CTRL</name>
                            <description>RW, ADC DMA enable</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_CTRL_DMA</name>
                    <description>RW, ADC DMA control</description>
                    <addressOffset>0x61</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_DMA_ENABLE</name>
                            <description>RW, ADC DMA enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_DMA_LOOP</name>
                            <description>RW, ADC DMA address loop enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_IE_DMA_END</name>
                            <description>RW, enable interrupt for ADC DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_IE_EOC</name>
                            <description>RW, enable interrupt for end of ADC conversion</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_CONT_EN</name>
                            <description>RW, enable contineous conversion ADC</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_AUTO_EN</name>
                            <description>RW, enable auto continuing ADC for DMA</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_DMA_IF</name>
                    <description>RO, ADC interrupt flag</description>
                    <addressOffset>0x62</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_IF_DMA_END</name>
                            <description>interrupt flag for ADC DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_IF_END_ADC</name>
                            <description>interrupt flag for end of ADC conversion</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_AUTO_CYCLE</name>
                    <description>RO, ADC interrupt flag</description>
                    <addressOffset>0x63</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_ADC_AUTO_CYCLE</name>
                            <description>auto ADC cycle value, unit is 16 Fsys</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_ADC_DMA_NOW</name>
                    <description>RO, ADC DMA current address</description>
                    <addressOffset>0x64</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R16_ADC_DMA_NOW</name>
                            <description>ADC DMA current address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_ADC_DMA_BEG</name>
                    <description>RW, ADC DMA begin address</description>
                    <addressOffset>0x68</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R16_ADC_DMA_BEG</name>
                            <description>ADC DMA begin address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_ADC_DMA_END</name>
                    <description>RW, ADC DMA end address</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R16_ADC_DMA_END</name>
                            <description>ADC DMA end address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PA_INT_EN</name>
                    <description>RW, GPIO PA interrupt enable</description>
                    <addressOffset>0x90</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_EN</name>
                            <description>GPIO PA interrupt enable</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PB_INT_EN</name>
                    <description>RW, GPIO PB interrupt enable</description>
                    <addressOffset>0x92</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PB_INT_EN</name>
                            <description> GPIO PB interrupt enable</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PA_INT_MODE</name>
                    <description>RW, GPIO PA interrupt mode: 0=level action, 1=edge action</description>
                    <addressOffset>0x94</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_MODE</name>
                            <description>  GPIO PA interrupt mode</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PB_INT_MODE</name>
                    <description>RW, GPIO PB interrupt mode: 0=level action, 1=edge action;RW, status for parallel slave read</description>
                    <addressOffset>0x96</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PB_INT_MODE</name>
                            <description> GPIO PB interrupt mode</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PA_INT_IF</name>
                    <description>RW1, GPIO PA interrupt flag</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_IF</name>
                            <description>  GPIO PA interrupt flag</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PB_INT_IF</name>
                    <description>RW1, GPIO PB interrupt flag</description>
                    <addressOffset>0x9E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PB_INT_IF</name>
                            <description>  GPIO PB interrupt flag</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_DIR</name>
                    <description>RW, GPIO PA I/O direction: 0=in, 1=out</description>
                    <size>32</size>
                    <addressOffset>0xA0</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_DIR_0</name>
                            <description> GPIO PA I/O direction byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_DIR_1</name>
                            <description> GPIO PA I/O direction byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PIN</name>
                    <description>RO, GPIO PA input</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PIN_0</name>
                            <description>GPIO PA input byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PIN_1</name>
                            <description>GPIO PA input byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_OUT</name>
                    <description>RW, GPIO PA output</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_OUT_0</name>
                            <description>GPIO PA output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_OUT_1</name>
                            <description>GPIO PA output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_CLR</name>
                    <description>WZ, GPIO PA clear output: 0=keep, 1=clear</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_CLR_0</name>
                            <description>GPIO PA clear output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_CLR_1</name>
                            <description>GPIO PA clear output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PU</name>
                    <description>RW, GPIO PA pullup resistance enable</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PU_0</name>
                            <description>GPIO PA pullup resistance enable byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PU_1</name>
                            <description>GPIO PA pullup resistance enable byte 0</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PD_DRV</name>
                    <description>RW, PA pulldown for input or PA driving capability for output</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PD_DRV_0</name>
                            <description>PA pulldown for input or PA driving capability for output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PD_DRV_1</name>
                            <description>PA pulldown for input or PA driving capability for output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_DIR</name>
                    <description>RW, GPIO PB I/O direction: 0=in, 1=out</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_DIR_0</name>
                            <description>GPIO PB I/O direction byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_DIR_1</name>
                            <description>GPIO PB I/O direction byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_DIR_2</name>
                            <description>GPIO PB I/O direction byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_PIN</name>
                    <description>RO, GPIO PB input</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_PIN_0</name>
                            <description> GPIO PB input byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PIN_1</name>
                            <description> GPIO PB input byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PIN_2</name>
                            <description> GPIO PB input byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_OUT__R8_SLV_RD_DATA</name>
                    <description>RW, GPIO PB output;RW, data for parallel slave read</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_OUT_0</name>
                            <description>GPIO PB output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_OUT_1</name>
                            <description>GPIO PB output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_OUT_2</name>
                            <description>GPIO PB output byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
