Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
                <register>
                    <name>R32_PB_CLR</name>
                    <description>WZ, GPIO PB clear output: 0=keep, 1=clear</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_CLR_0</name>
                            <description>GPIO PB clear output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_CLR_1</name>
                            <description>GPIO PB clear output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_CLR_2</name>
                            <description>GPIO PB clear output byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_PU</name>
                    <description>RW, GPIO PB pullup resistance enable</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_PU_0</name>
                            <description>GPIO PB pullup resistance enable byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PU_1</name>
                            <description>GPIO PB pullup resistance enable byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PU_2</name>
                            <description>GPIO PB pullup resistance enable byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_PD_DRV</name>
                    <description>RW, PB pulldown for input or PB driving capability for output</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_PD_DRV_0</name>
                            <description>PB pulldown for input or PB driving capability for output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PD_DRV_1</name>
                            <description>PB pulldown for input or PB driving capability for output byte 0</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PD_DRV_2</name>
                            <description>PB pulldown for input or PB driving capability for output byte 0</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>

        <peripheral>
            <name>TMR0</name>
            <description>Timer0 register</description>
            <groupName>TMR</groupName>
            <baseAddress>0x40002000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR0</name>
                <description>TMR0_IRQHandler</description>
                <value>16</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_TMR0_CTRL_MOD</name>
                    <description>RW, TMR0 mode control</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>RB_TMR_MODE_IN</name>
                            <description>RW, timer in mode: 0=timer/PWM, 1=capture/count</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_ALL_CLEAR</name>
                            <description>RW, force clear timer FIFO and count</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_COUNT_EN</name>
                            <description>RW, timer count enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_OUT_EN</name>
                            <description>RW, timer output enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_OUT_POLAR/RB_TMR_CAP_COUNT</name>
                            <description>RW, timer PWM output polarity: 0=default low and high action, 1=default high and low action;RW, count sub-mode if RB_TMR_MODE_IN=1: 0=capture, 1=count</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_PWM_REPEAT/RB_TMR_CAP_EDGE</name>
                            <description>RW, timer PWM repeat mode: 00=1, 01=4, 10=8, 11-16;RW, timer capture edge mode: 00=disable, 01=edge change, 10=fall to fall, 11-rise to rise</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TMR0_INTER_EN</name>
                    <description>RW, TMR0 interrupt enable</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TMR_IE_CYC_END</name>
                            <description>RW, enable interrupt for timer capture count timeout or PWM cycle end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IE_DATA_ACT</name>
                            <description>RW, enable interrupt for timer capture input action or PWM trigger</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IE_FIFO_HF</name>
                            <description>RW, enable interrupt for timer FIFO half (capture fifo >=4 or PWM fifo less than 3)</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IE_DMA_END</name>
                            <description>RW, enable interrupt for timer1/2 DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IE_FIFO_OV</name>
                            <description>RW, enable interrupt for timer FIFO overflow</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TMR0_INT_FLAG</name>
                    <description>RW1, TMR0 interrupt flag</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TMR_IF_CYC_END</name>
                            <description>RW1, interrupt flag for timer capture count timeout or PWM cycle end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IF_DATA_ACT</name>
                            <description>RW1, interrupt flag for timer capture input action or PWM trigger</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IF_FIFO_HF</name>
                            <description>RW1, interrupt flag for timer FIFO half (capture fifo >=4 or PWM fifo less than 3 </description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IF_DMA_END</name>
                            <description>RW1, interrupt flag for timer1/2 DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IF_FIFO_OV</name>
                            <description>RW1, interrupt flag for timer FIFO overflow</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TMR0_FIFO_COUNT</name>
                    <description>RO, TMR0 FIFO count status</description>
                    <addressOffset>0x07</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0X</resetValue>
                    <fields>
                        <field>
                            <name>R8_TMR0_FIFO_COUNT</name>
                            <description>RW1,TMR0 FIFO count status</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_TMR0_COUNT</name>
                    <description>RO, TMR0 current count</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_TMR0_COUNT</name>
                            <description>RW1,TMR0 current count</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_TMR0_CNT_END</name>
                    <description>RW, TMR0 end count value, only low 26 bit</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_TMR0_CNT_END</name>
                            <description>RW1,TMR0 end count value</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_TMR0_FIFO</name>
                    <description>RO/WO, TMR0 FIFO register, only low 26 bit</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_TMR0_FIFO</name>
                            <description>RW1,TMR0 FIFO register</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
