Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TMR3</name>
            <description>Timer3 register</description>
            <groupName>TMR</groupName>
            <baseAddress>0x40002C00</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR3</name>
                <description>TMR3_IRQHandler</description>
                <value>32</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_TMR3_CTRL_MOD</name>
                    <description>RW, TMR3 mode control</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>RB_TMR_MODE_IN</name>
                            <description>RW, timer in mode: 0=timer/PWM, 1=capture/count</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_ALL_CLEAR</name>
                            <description>RW, force clear timer FIFO and count</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_COUNT_EN</name>
                            <description>RW, timer count enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_OUT_EN</name>
                            <description>RW, timer output enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_OUT_POLAR/RB_TMR_CAP_COUNT</name>
                            <description>RW, timer PWM output polarity: 0=default low and high action, 1=default high and low action;RW, count sub-mode if RB_TMR_MODE_IN=1: 0=capture, 1=count</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_PWM_REPEAT/RB_TMR_CAP_EDGE</name>
                            <description>RW, timer PWM repeat mode: 00=1, 01=4, 10=8, 11-16;RW, timer capture edge mode: 00=disable, 01=edge change, 10=fall to fall, 11-rise to rise</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TMR3_INTER_EN</name>
                    <description>RW, TMR3 interrupt enable</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TMR_IE_CYC_END</name>
                            <description>RW, enable interrupt for timer capture count timeout or PWM cycle end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IE_DATA_ACT</name>
                            <description>RW, enable interrupt for timer capture input action or PWM trigger</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IE_FIFO_HF</name>
                            <description>RW, enable interrupt for timer FIFO half (capture fifo >=4 or PWM fifo less than 3)</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IE_DMA_END</name>
                            <description>RW, enable interrupt for timer1/2 DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IE_FIFO_OV</name>
                            <description>RW, enable interrupt for timer FIFO overflow</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TMR3_INT_FLAG</name>
                    <description>RW1, TMR3 interrupt flag</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TMR_IF_CYC_END</name>
                            <description>RW1, interrupt flag for timer capture count timeout or PWM cycle end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IF_DATA_ACT</name>
                            <description>RW1, interrupt flag for timer capture input action or PWM trigger</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IF_FIFO_HF</name>
                            <description>RW1, interrupt flag for timer FIFO half (capture fifo >=4 or PWM fifo less than 3 </description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IF_DMA_END</name>
                            <description>RW1, interrupt flag for timer1/2 DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_TMR_IF_FIFO_OV</name>
                            <description>RW1, interrupt flag for timer FIFO overflow</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TMR3_FIFO_COUNT</name>
                    <description>RO, TMR3 FIFO count status</description>
                    <addressOffset>0x07</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0X</resetValue>
                    <fields>
                        <field>
                            <name>R8_TMR3_FIFO_COUNT</name>
                            <description>R0, TMR3 FIFO count status</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_TMR3_COUNT</name>
                    <description>RO, TMR3 current count</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x000000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_TMR3_COUNT</name>
                            <description>R0, TMR3 current count</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_TMR3_CNT_END</name>
                    <description>RW, TMR3 end count value, only low 26 bit</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_TMR3_CNT_END</name>
                            <description>RW, TMR3 end count value, only low 26 bit</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_TMR3_FIFO</name>
                    <description>RO/WO, TMR3 FIFO register, only low 26 bit</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_TMR3_FIFO</name>
                            <description>RO/WO, TMR3 FIFO register, only low 26 bit</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
