Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SPI0</name>
            <description>SPI0 register</description>
            <groupName>SPI0</groupName>
            <baseAddress>0x40004000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SPI0</name>
                <description>SPI0_IRQHandler</description>
                <value>19</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_SPI0_CTRL_MOD</name>
                    <description>RW, SPI0 mode control</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_MODE_SLAVE</name>
                            <description>RW, SPI0 slave mode: 0=master or host, 1=slave or device</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_ALL_CLEAR</name>
                            <description>RW, force clear SPI FIFO and count</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_2WIRE_MOD</name>
                            <description>RW, SPI0 enable 2 wire mode for slave: 0=3wire(SCK0,MOSI,MISO), 1=2wire(SCK0,MISO=MXSX)</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_MST_SCK_MOD__RB_SPI_SLV_CMD_MOD</name>
                            <description>RW, SPI master clock mode: 0=mode 0, 1=mode 3;RW, SPI0 slave command mode: 0=byte stream, 1=first byte command</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_FIFO_DIR</name>
                            <description>RW, SPI FIFO direction: 0=out(write @master mode), 1=in(read @master mode)</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_SCK_OE</name>
                            <description>RW, SPI SCK output enable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_MOSI_OE</name>
                            <description>RW, SPI MOSI output enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_MISO_OE</name>
                            <description>RW, SPI MISO output enable</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_CTRL_CFG</name>
                    <description>RW, SPI0 configuration control</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_DMA_ENABLE</name>
                            <description>RW, SPI0 DMA enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_DMA_LOOP</name>
                            <description>RW, SPI0 DMA address loop enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_AUTO_IF</name>
                            <description>RW, enable buffer/FIFO accessing to auto clear RB_SPI_IF_BYTE_END interrupt flag</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_BIT_ORDER</name>
                            <description>RW, SPI bit data order: 0=MSB first, 1=LSB first</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_MST_DLY_EN</name>
                            <description>RW, SPI master input delay enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_INTER_EN</name>
                    <description>RW, SPI0 interrupt enable</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_IE_CNT_END</name>
                            <description>RW, enable interrupt for SPI total byte count end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_BYTE_END</name>
                            <description>RW, enable interrupt for SPI byte exchanged</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_FIFO_HF</name>
                            <description>RW, enable interrupt for SPI FIFO half</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_DMA_END</name>
                            <description>RW, enable interrupt for SPI0 DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_FIFO_OV</name>
                            <description>RW, enable interrupt for SPI0 FIFO overflow</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_FST_BYTE</name>
                            <description>RW, enable interrupt for SPI0 slave mode first byte received</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_CLOCK_DIV__R8_SPI0_SLAVE_PRE</name>
                    <description>RW, SPI0 master clock divisor;RW, SPI0 slave preset value</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI0_CLOCK_DIV__R8_SPI0_SLAVE_PRE</name>
                            <description>RW, SPI0 master clock divisor;RW, SPI0 slave preset value</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_BUFFER</name>
                    <description>RW, SPI0 data buffer</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI0_BUFFER</name>
                            <description>RW, SPI0 data buffer</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_RUN_FLAG</name>
                    <description>RO, SPI0 work flag</description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_SLV_CMD_ACT</name>
                            <description>RO, SPI0 slave first byte or  command flag</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_FIFO_READY</name>
                            <description>RO, SPI FIFO ready status</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_SLV_CS_LOAD</name>
                            <description>RO, SPI0 slave chip-select loading status</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_SLV_SELECT</name>
                            <description>RO, SPI0 slave selection status</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_INT_FLAG</name>
                    <description>RW1, SPI0 interrupt flag</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_IF_CNT_END</name>
                            <description>RW1, interrupt flag for SPI total byte count end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_BYTE_END</name>
                            <description>RW1, interrupt flag for SPI byte exchanged</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_FIFO_HF</name>
                            <description>RW1, interrupt flag for SPI FIFO half </description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_DMA_END</name>
                            <description>RW1, interrupt flag for SPI0 DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_FIFO_OV</name>
                            <description>RW1, interrupt flag for SPI0 FIFO overflow</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_FREE</name>
                            <description>RO, current SPI free status</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_FST_BYTE</name>
                            <description>RW1, interrupt flag for SPI0 slave mode first byte received</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_FIFO_COUNT</name>
                    <description>RO, SPI0 FIFO count status</description>
                    <addressOffset>0x07</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI0_FIFO_COUNT</name>
                            <description>RO, SPI0 FIFO count status</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_SPI0_TOTAL_CNT</name>
                    <description>RW, SPI0 total byte count, only low 12 bit</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_SPI0_TOTAL_CNT</name>
                            <description>RW, SPI0 total byte count, only low 12 bit</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_FIFO</name>
                    <description>RO/WO, SPI0 FIFO register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI0_FIFO</name>
                            <description>RO/WO, SPI0 FIFO register</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI0_FIFO_COUNT1</name>
                    <description>RO, SPI0 FIFO count status</description>
                    <addressOffset>0x13</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI0_FIFO_COUNT1</name>
                            <description>RO, SPI0 FIFO count status</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_SPI0_DMA_NOW</name>
                    <description>RW, SPI0 DMA current address</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_SPI0_DMA_NOW</name>
                            <description>RW, SPI0 DMA current address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_SPI0_DMA_BEG</name>
                    <description>RW, SPI0 DMA begin address</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_SPI0_DMA_BEG</name>
                            <description>RW, SPI0 DMA begin address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_SPI0_DMA_END</name>
                    <description>RW, SPI0 DMA end address</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_SPI0_DMA_END</name>
                            <description>RW, SPI0 DMA end address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
