Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>I2C</name>
            <description>I2C register</description>
            <groupName>I2C</groupName>
            <baseAddress>0x40004800</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>I2C</name>
                <description>I2C_IRQHandler</description>
                <value>30</value>
            </interrupt>
            <registers>
                <register>
                    <name>R16_I2C_CTRL1</name>
                    <description>RW, I2C control 1</description>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_I2C_PE</name>
                            <description>RW, Peripheral enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_SMBUS</name>
                            <description>RW, SMBUS mode: 0=I2C mode, 1=SMBUS mode</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_SMBTYPE</name>
                            <description>RW, SMBus type: 0=Device, 1=Host</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_EBARP</name>
                            <description>RW, ARP enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ENPEC</name>
                            <description>RW, PEC ebable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ENGC</name>
                            <description>RW, General call enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_NOSTRETCH</name>
                            <description>RW, Clock stretching disable (Slave mode)</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_START</name>
                            <description>RW, Start generation: master mode: 0=no start, 1=repeated start; slave mode: 0=no start, 1=start at bus free</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_STOP</name>
                            <description>RW, Stop generation: master mode: 0=no stop, 1=stop after the current byte transfer or after the current Start condition is sent; slave mode: 0=no stop, 1=Release the SCL and SDA lines after the current byte transfer</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ACK</name>
                            <description>RW, Acknowledge enable</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_POS</name>
                            <description>RW, Acknowledge/PEC Position (for data reception)</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_PEC</name>
                            <description>RW, Packet error checking: 0=No PEC transfer, 1=PEC transfer (in Tx or Rx mode)</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ALERT</name>
                            <description>RW, SMBus alert: 0=Releases SMBA pin high, 1=Drives SMBA pin low.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_SWRST</name>
                            <description>RW, Software reset</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_I2C_CTRL2</name>
                    <description>RW, I2C control 2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_I2C_FREQ</name>
                            <description>RW, Peripheral clock frequency, The minimum allowed frequency is 2 MHz,the maximum frequency is 36 MHz</description>
                            <bitRange>[5:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ITERREN</name>
                            <description>RW, Error interrupt enable</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ITEVTEN</name>
                            <description>RW, Event interrupt enable</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ITBUFEN</name>
                            <description>RW, Buffer interrupt enable</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_I2C_OADDR1</name>
                    <description>RW, I2C own address register 1</description>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_I2C_ADD0</name>
                            <description>RW, bit0 of address in 10-bit addressing mode</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ADD7_1</name>
                            <description>RW, bit[7:1] of address</description>
                            <bitRange>[7:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ADD9_8</name>
                            <description>RW, bit[9:8] of address in 10-bit addressing mode</description>
                            <bitRange>[9:8]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_MUST1</name>
                            <description>RW, Should always be kept at 1</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ADDMODE</name>
                            <description>RW, Addressing mode (slave mode): 0=7-bit slave address, 1=10-bit slave address</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_I2C_OADDR2</name>
                    <description>RW, I2C own address register 2</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_I2C_ENDUAL</name>
                            <description>RW, Dual addressing mode enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ADD2</name>
                            <description>RW, bit[7:1] of address2</description>
                            <bitRange>[7:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_I2C_DATAR</name>
                    <description>RW, I2C data register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_I2C_DATAR</name>
                            <description>RW, I2C data register</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_I2C_STAR1</name>
                    <description>R0, I2C stauts register 1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_I2C_SB</name>
                            <description>RW0, Start bit flag (Master mode)</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ADDR</name>
                            <description>RW0, Address sent (master mode)/matched (slave mode) flag</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_BTF</name>
                            <description>RO, Byte transfer finished flag</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ADD10</name>
                            <description>RO, 10-bit header sent flag (Master mode)</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_STOPF</name>
                            <description>RO, Stop detection flag (slave mode)</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_RxNE</name>
                            <description>RO, Data register not empty flag (receivers)</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_TxE</name>
                            <description>RO, Data register empty flag (transmitters)</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_BERR</name>
                            <description>RW0, Bus error flag</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_ARLO</name>
                            <description>RW0, Arbitration lost flag (master mode)</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_AF</name>
                            <description>RW0, Acknowledge failure flag</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_OVR</name>
                            <description>RW0, Overrun/Underrun flag</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_PECERR</name>
                            <description>RW0, PEC Error flag in reception</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_TIMEOUT</name>
                            <description>RW0, Timeout or Tlow error flag</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_SMBALERT</name>
                            <description>RW0, SMBus alert flag</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_I2C_STAR2</name>
                    <description>R0, I2C status register 2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_I2C_MSL</name>
                            <description>RO, Mode statu: 0=Slave mode, 1=Master mode</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_BUSY</name>
                            <description>RO, Bus busy flag</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_TRA</name>
                            <description>RO, Trans flag: 0=data bytes received, 1=data bytes transmitted</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_GENCALL</name>
                            <description>RO, General call address (Slave mode) received flag</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_SMBDEFAULT</name>
                            <description>RO, SMBus device default address (Slave mode) received flag</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_SMBHOST</name>
                            <description>RO, SMBus host header (Slave mode) received flag</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_DUALF</name>
                            <description>RO, Dual flag (Slave mode): 0=Received address matched with OAR1, 1=Received address matched with OAR2</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_PECX</name>
                            <description>RO, Packet error checking register</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_I2C_PEC</name>
                    <description>R0, I2C Packet error checking register </description>
                    <addressOffset>0x19</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI0_FIFO_COUNT</name>
                            <description>RO, SPI0 FIFO count status</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_I2C_CKCFGR</name>
                    <description>RW, I2C clock control register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_I2C_CCR</name>
                            <description>RW, Controls the SCL clock in Fm/Sm mode (Master mode)</description>
                            <bitRange>[11:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_DUTY</name>
                            <description>RW, Fm mode duty cycle: 0=L/H=2, 1=L/H=16/9</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>RB_I2C_F_S</name>
                            <description>RW, I2C master mode selection: 0=standard mode, 1=fast mode</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_I2C_RTR</name>
                    <description>RW, I2C trise register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0002</resetValue>
                    <fields>
                        <field>
                            <name>RB_I2C_TRISE</name>
                            <description>RW, Maximum rise time in Fm/Sm mode (Master mode)</description>
                            <bitRange>[5:0]</bitRange>
                        </field>
                    </fields>
                </register>
