Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
                <register>
                    <name>R8_U2EP2_3_MOD__R8_U2H_EP_MOD</name>
                    <description>endpoint 2_3 mode;host endpoint mode</description>
                    <addressOffset>0x0D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UEP2_BUF_MOD__RB_UH_EP_RBUF_MOD</name>
                            <description>buffer mode of USB endpoint 2;buffer mode of USB host IN endpoint</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP2_TX_EN</name>
                            <description>enable USB endpoint 2 transmittal (IN)</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP2_RX_EN__RB_UH_EP_RX_EN</name>
                            <description>enable USB endpoint 2 receiving (OUT);enable USB host IN endpoint receiving</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP3_BUF_MOD__RB_UH_EP_TBUF_MOD</name>
                            <description>buffer mode of USB endpoint 3;buffer mode of USB host OUT endpoint</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP3_TX_EN__RB_UH_EP_TX_EN</name>
                            <description>enable USB endpoint 3 transmittal (IN);enable USB host OUT endpoint transmittal</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP3_RX_EN</name>
                            <description>enable USB endpoint 3 receiving (OUT)</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP567_MOD</name>
                    <description>USB2 endpoint 5/6/7 mode</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UEP5_TX_EN</name>
                            <description>enable USB endpoint 5 transmittal (IN)</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP5_RX_EN</name>
                            <description>enable USB endpoint 5 receiving (OUT)</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP6_TX_EN</name>
                            <description>enable USB endpoint 6 transmittal (IN)</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP6_RX_EN</name>
                            <description>enable USB endpoint 6 receiving (OUT)</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP7_TX_EN</name>
                            <description>enable USB endpoint 7 transmittal (IN)</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP7_RX_EN</name>
                            <description>enable USB endpoint 7 receiving (OUT)</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_U2EP0_DMA</name>
                    <description>endpoint 0 DMA buffer address</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP0_DMA</name>
                            <description>RW,endpoint 0 DMA buffer address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_U2EP1_DMA</name>
                    <description>USB2 endpoint 1 DMA buffer address</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP1_DMA</name>
                            <description>RW,endpoint 1 DMA buffer address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_U2EP2_DMA__R16_U2H_RX_DMA</name>
                    <description>USB2 endpoint 2 DMA buffer address;host rx endpoint buffer high address</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP2_DMA</name>
                            <description>RW,endpoint 2 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_U2EP3_DMA__R16_U2H_TX_DMA</name>
                    <description>USB2 endpoint 3 DMA buffer address;host tx endpoint buffer high address</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>R16_UEP3_DMA</name>
                            <description>RW,endpoint 3 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_U2EP5_DMA</name>
                    <description>USB2 endpoint 5 DMA buffer address</description>
                    <addressOffset>0x54</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>R16_UEP5_DMA</name>
                            <description>RW,endpoint 5 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_U2EP6_DMA</name>
                    <description>USB2 endpoint 6 DMA buffer address</description>
                    <addressOffset>0x58</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>R16_UEP6_DMA</name>
                            <description>RW,endpoint 6 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_U2EP7_DMA</name>
                    <description>USB2 endpoint 7 DMA buffer address</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>R16_UEP7_DMA</name>
                            <description>RW,endpoint 7 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP0_T_LEN</name>
                    <description>USB2 endpoint 0 transmittal length</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP0_T_LEN</name>
                            <description>endpoint 0 transmittal length</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP0_CTRL</name>
                    <description>USB2 endpoint 0 control</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP1_T_LEN</name>
                    <description>USB2 endpoint 1 transmittal length</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP1_T_LEN</name>
                            <description>endpoint 1 transmittal length</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP1_CTRL__R8_U2H_SETUP</name>
                    <description>USB2 endpoint 1 control;host aux setup</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG__RB_UH_SOF_EN</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1;USB host automatic SOF enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG__RB_UH_PRE_PID_EN</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;RB_UH_PRE_PID_EN;USB host PRE PID enable for low speed device via hub</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP2_T_LEN_R8_U2H_EP_PID</name>
                    <description>USB2 endpoint 2 transmittal length;host endpoint and PID</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UH_ENDP</name>
                            <description>bit mask of endpoint number for USB host transfer</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UH_TOKEN</name>
                            <description>bit mask of token PID for USB host transfer</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>R8_UEP2_T_LEN</name>
                            <description>endpoint 2 transmittal length;</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP2_CTRL_R8_U2H_RX_CTRL</name>
                    <description>USB2 endpoint 2 control;host receiver endpoint control</description>
                    <addressOffset>0x2A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UH_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG__RB_UH_R_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle;enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG__RB_UH_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP3_T_LEN__R8_U2H_TX_LEN</name>
                    <description>USB2 endpoint 3 transmittal length;host transmittal endpoint transmittal length</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP3_T_LEN__R8_UH_TX_LEN</name>
                            <description>endpoint 1 transmittal length</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP3_CTRL__R8_U2H_TX_CTRL</name>
                    <description>USB2 endpoint 3 control;host transmittal endpoint control</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_UH_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG_RB_UH_T_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG_RB_UH_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP4_T_LEN</name>
                    <description>USB2 endpoint 4 transmittal length</description>
                    <addressOffset>0x30</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP4_T_LEN</name>
                            <description>endpoint 4 transmittal length</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
