Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
                <register>
                    <name>R8_U2EP4_CTRL</name>
                    <description>USB2 endpoint 4 control</description>
                    <addressOffset>0x32</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP5_T_LEN</name>
                    <description>USB2 endpoint 5 transmittal length</description>
                    <addressOffset>0x64</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP5_T_LEN</name>
                            <description>endpoint 5 transmittal length</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP5_CTRL</name>
                    <description>USB2 endpoint 5 control</description>
                    <addressOffset>0x66</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP6_T_LEN</name>
                    <description>USB2 endpoint 6 transmittal length</description>
                    <addressOffset>0x68</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP6_T_LEN</name>
                            <description>endpoint 6 transmittal length</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP6_CTRL</name>
                    <description>USB2 endpoint 6 control</description>
                    <addressOffset>0x6A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP7_T_LEN</name>
                    <description>USB2 endpoint 7 transmittal length</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP7_T_LEN</name>
                            <description>endpoint 7 transmittal length</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_U2EP7_CTRL</name>
                    <description>USB2 endpoint 7 control</description>
                    <addressOffset>0x6E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
