Community-PIO-CH32V/platform-ch32v/misc/svd/CH583.svd
                <register>
                    <name>R32_PFIC_IPRIOR5</name>
                    <displayName>IPRIOR5</displayName>
                    <description>Interrupt Priority configuration Register 5</description>
                    <addressOffset>0x4A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR5</name>
                            <description>>RW,Interrupt priority for number 20-23</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR6</name>
                    <displayName>IPRIOR6</displayName>
                    <description>Interrupt Priority configuration Register 6</description>
                    <addressOffset>0x4C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR6</name>
                            <description>>RW,Interrupt priority for number 24-27</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR7</name>
                    <displayName>IPRIOR7</displayName>
                    <description>Interrupt Priority configuration Register 7</description>
                    <addressOffset>0x4E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR7</name>
                            <description>>RW,Interrupt priority for number 28-31</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR8</name>
                    <displayName>IPRIOR8</displayName>
                    <description>Interrupt Priority configuration Register 8</description>
                    <addressOffset>0x500</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR8</name>
                            <description>>RW,Interrupt priority for number 32-35</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR9</name>
                    <displayName>IPRIOR9</displayName>
                    <description>Interrupt Priority configuration Register 9</description>
                    <addressOffset>0x520</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR9</name>
                            <description>>RW,Interrupt priority for number 36-39</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR10</name>
                    <displayName>IPRIOR10</displayName>
                    <description>Interrupt Priority configuration Register 10</description>
                    <addressOffset>0x540</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR10</name>
                            <description>>RW,Interrupt priority for number 40-43</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR11</name>
                    <displayName>IPRIOR11</displayName>
                    <description>Interrupt Priority configuration Register 11</description>
                    <addressOffset>0x560</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR11</name>
                            <description>RW,Interrupt priority for number 44-47</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR12</name>
                    <displayName>IPRIOR12</displayName>
                    <description>Interrupt Priority configuration Register 12</description>
                    <addressOffset>0x580</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR12</name>
                            <description>RW,Interrupt priority for number 48-51</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR13</name>
                    <displayName>IPRIOR13</displayName>
                    <description>Interrupt Priority configuration Register 13</description>
                    <addressOffset>0x5A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR13</name>
                            <description>RW,Interrupt priority for number 52-55</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR14</name>
                    <displayName>IPRIOR14</displayName>
                    <description>Interrupt Priority configuration Register 14</description>
                    <addressOffset>0x5C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR14</name>
                            <description>RW,Interrupt priority for number 56-59</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR15</name>
                    <displayName>IPRIOR15</displayName>
                    <description>Interrupt Priority configuration Register 15</description>
                    <addressOffset>0x5E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR15</name>
                            <description>RW,Interrupt priority for number 60-63</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR16</name>
                    <displayName>IPRIOR16</displayName>
                    <description>Interrupt Priority configuration Register 16</description>
                    <addressOffset>0x600</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR16</name>
                            <description>RW,Interrupt priority for number 64-67</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR17</name>
                    <displayName>IPRIOR17</displayName>
                    <description>Interrupt Priority configuration Register 17</description>
                    <addressOffset>0x620</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR17</name>
                            <description>RW,Interrupt priority for number 68-71</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR18</name>
                    <displayName>IPRIOR18</displayName>
                    <description>Interrupt Priority configuration Register 18</description>
                    <addressOffset>0x640</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR18</name>
                            <description>RW,Interrupt priority for number 72-75</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR19</name>
                    <displayName>IPRIOR19</displayName>
                    <description>Interrupt Priority configuration Register 19</description>
                    <addressOffset>0x660</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR19</name>
                            <description>RW,Interrupt priority for number 76-79</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR20</name>
                    <displayName>IPRIOR20</displayName>
                    <description>Interrupt Priority configuration Register 20</description>
                    <addressOffset>0x680</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR20</name>
                            <description>RW,RW,Interrupt priority for number 80-83</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR21</name>
                    <displayName>IPRIOR21</displayName>
                    <description>Interrupt Priority configuration Register 21</description>
                    <addressOffset>0x6A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR21</name>
                            <description>RW,Interrupt priority for number 84-87</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR22</name>
                    <displayName>IPRIOR22</displayName>
                    <description>Interrupt Priority configuration Register 22</description>
                    <addressOffset>0x6C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR22</name>
                            <description>RW,Interrupt priority for number 88-91</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR23</name>
                    <displayName>IPRIOR23</displayName>
                    <description>Interrupt Priority configuration Register 23</description>
                    <addressOffset>0x6E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR23</name>
                            <description>RW,Interrupt priority for number 92-95</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR24</name>
                    <displayName>IPRIOR24</displayName>
                    <description>Interrupt Priority configuration Register 24</description>
                    <addressOffset>0x700</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR24</name>
                            <description>RW,Interrupt priority for number 96-99</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR25</name>
                    <displayName>IPRIOR25</displayName>
                    <description>Interrupt Priority configuration Register 25</description>
                    <addressOffset>0x720</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR25</name>
                            <description>RW,Interrupt priority for number 100-103</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR26</name>
                    <displayName>IPRIOR26</displayName>
                    <description>Interrupt Priority configuration Register 26</description>
                    <addressOffset>0x740</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR26</name>
                            <description>RW,Interrupt priority for number 104-107</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR27</name>
                    <displayName>IPRIOR27</displayName>
                    <description>Interrupt Priority configuration Register 27</description>
                    <addressOffset>0x760</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR27</name>
                            <description>RW,Interrupt priority for number 108-111</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR28</name>
                    <displayName>IPRIOR28</displayName>
                    <description>Interrupt Priority configuration Register 28</description>
                    <addressOffset>0x780</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR28</name>
                            <description>RW,Interrupt priority for number 112-115</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR29</name>
                    <displayName>IPRIOR29</displayName>
                    <description>Interrupt Priority configuration Register  29</description>
                    <addressOffset>0x7A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR29</name>
                            <description>RW,Interrupt priority for number 116-119</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR30</name>
                    <displayName>IPRIOR30</displayName>
                    <description>Interrupt Priority configuration Register 30</description>
                    <addressOffset>0x7C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR30</name>
                            <description>RW,Interrupt priority for number 120-123</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR31</name>
                    <displayName>IPRIOR31</displayName>
                    <description>Interrupt Priority configuration Register 31</description>
                    <addressOffset>0x7E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR31</name>
                            <description>RW,Interrupt priority for number 124-127</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR32</name>
                    <displayName>IPRIOR32</displayName>
                    <description>Interrupt Priority configuration Register 32</description>
                    <addressOffset>0x800</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR32</name>
                            <description>RW,Interrupt priority for number 128-131</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR33</name>
                    <displayName>IPRIOR33</displayName>
                    <description>Interrupt Priority configuration Register 33</description>
                    <addressOffset>0x820</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR33</name>
                            <description>RW,Interrupt priority for number 132-135</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR34</name>
                    <displayName>IPRIOR34</displayName>
                    <description>Interrupt Priority configuration Register 34</description>
                    <addressOffset>0x840</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR34</name>
                            <description>RW,Interrupt priority for number 136-139</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
